tap "armmbed/formulae"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Print a list of paths as a tree of paths
brew "as-tree"
# Mozilla CA certificate store
brew "ca-certificates"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound", link: false
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# OpenType text shaping engine
brew "harfbuzz"
# Command-line hex viewer
brew "hexyl"
# Add GitHub support to git on the command-line
brew "hub"
# Library for complex text layout
brew "libraqm"
# Library for converting WMF (Window Metafile Format) files
brew "libwmf"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Web browser focusing on privacy
cask "brave-browser"
# PNG image optimiser
cask "crunch"
# Desktop client for GitHub repositories
cask "github"
# Tools to protect your emails and files
cask "gpg-suite"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "earshinov.permute-lines"
vscode "eddjrn.e-ink"
vscode "esbenp.prettier-vscode"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mufanza.e-ink-theme"
vscode "ow.vscode-subword-navigation"
vscode "silvenon.mdx"
vscode "sirtobi.pegjs-language"
vscode "vsciot-vscode.vscode-arduino"
