tap "1password/tap"
tap "armmbed/formulae"
tap "getcord/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Print a list of paths as a tree of paths
brew "as-tree"
# Collection of portable C++ source libraries
brew "boost"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Mozilla CA certificate store
brew "ca-certificates"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Command-line hex viewer
brew "hexyl"
# Add GitHub support to git on the command-line
brew "hub"
# C library implementing the SSH2 protocol
brew "libssh2"
# Library for converting WMF (Window Metafile Format) files
brew "libwmf"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@11", restart_service: true
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
# Submit pull requests for individual, amendable, rebaseable commits to GitHub
brew "getcord/tap/spr"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Web browser focusing on privacy
cask "brave-browser"
# PNG image optimiser
cask "crunch"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your emails and files
cask "gpg-suite"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Shows the next meeting in the menu bar
cask "meetingbar"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "earshinov.permute-lines"
vscode "eddjrn.e-ink"
vscode "esbenp.prettier-vscode"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mufanza.e-ink-theme"
vscode "ow.vscode-subword-navigation"
vscode "sirtobi.pegjs-language"
vscode "unifiedjs.vscode-mdx"
vscode "vsciot-vscode.vscode-arduino"
